Revit 2027 API
BuiltInFailures.BendFailures.NotBentFilledRegion Property
 While making curved beam type "[Type Name]" Filled Region elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotBentFilledRegion { get; }
Public Shared ReadOnly Property NotBentFilledRegion As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotBentFilledRegion {
	FailureDefinitionId^ get ();
}
static member NotBentFilledRegion : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace